app/Controllers/Announcement.php

SELECT *
FROM `announcements`
ORDER BY `created_at` DESC
---
    public function index()
    {
        $announcementModel = new AnnouncementModel();

        $data['announcements'] = $announcementModel->orderBy('created_at', 'DESC')->findAll();