app/Controllers/Auth.php

    public function login()
    {
        // Check if form was submitted (POST request)
        if ($this->request->getMethod() === 'POST') {
            // Set validation rules
            $validation = \Config\Services::validation();
            $validation->setRules([
                'username' => [
                    'rules'  => 'required',
                    'errors' => [
                        'required' => 'Username or Email is required',
                    ]
                ],
                'password' => [
                    'rules'  => 'required',
                    'errors' => [
                        'required' => 'Password is required'
                    ]
                ]
            ]);

            if ($validation->withRequest($this->request)->run()) {
                $identifier = trim((string) $this->request->getPost('username'));
                $password   = (string) $this->request->getPost('password');

                // Find by username OR email
                $userModel = new \App\Models\UserModel();
                $user = $userModel
                    ->groupStart()
                        ->where('username', $identifier)
                        ->orWhere('email', $identifier)
                    ->groupEnd()
                    ->first();
---
SELECT *
FROM `users`
WHERE   (
`username` = 'teacher1'
OR `email` = 'teacher1'
 )
 LIMIT 1

                $builder->where('instructor_id', $userId);
            }

            $data['courses'] = $builder
                ->orderBy('title', 'ASC')
                ->get()
                ->getResultArray();
---
SELECT `id`, `title`
FROM `courses`
ORDER BY `title` ASC

            }

            // Simple counts for dashboard cards (admins see global, teachers see limited view still based on whole tables)
            $data['totalUsers']   = (int) $db->table('users')->countAllResults();
            $data['totalCourses'] = (int) $db->table('courses')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `courses`