app/Controllers/Materials.php

    public function upload($course_id)
    {
        // must be admin or teacher
        if (!session()->get('isLoggedIn') || !in_array(session('role'), ['admin','teacher'], true)) {
            return redirect()->to(base_url('login'));
        }

        // Verify course exists to avoid FK insert failure
        $courseId = (int) $course_id;
        $exists = db_connect()->table('courses')->where('id', $courseId)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `courses`
WHERE `id` = 2

    public function delete($id)
    {
        if (!session()->get('isLoggedIn') || session('role') !== 'admin') {
            return redirect()->to(base_url('login'));
        }
        $material = $this->materialsModel->find($id);
        if ($material) {
            $path = $this->resolvePath($material['file_path']);
            if (is_file($path)) {
                @unlink($path);
            }
            $this->materialsModel->delete($id);
---
SELECT *
FROM `materials`
WHERE `materials`.`id` = '1'
DELETE FROM `materials`
WHERE `id` IN ('1')

    public function list($course_id)
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to(base_url('login'));
        }

        $courseId = (int) $course_id;

        // quick guard: ensure course exists
        $exists = db_connect()->table('courses')->where('id', $courseId)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `courses`
WHERE `id` = 1

                        $notifModel  = new NotificationModel();

                        // Get course title for friendlier message
                        $courseRow = db_connect()->table('courses')
                            ->select('title')
                            ->where('id', (int) $course_id)
                            ->get()
                            ->getRowArray();
---
SELECT `title`
FROM `courses`
WHERE `id` = 2