app/Models/EnrollmentModel.php

    public function getUserEnrollmentsDetailed(int $user_id): array
    {
        return $this->select('courses.id, courses.title, courses.description')
            ->join('courses', 'courses.id = enrollments.course_id')
            ->where('enrollments.user_id', $user_id)
            ->findAll();
---
SELECT `courses`.`id`, `courses`.`title`, `courses`.`description`
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
WHERE `enrollments`.`user_id` = 3

    public function getAvailableCourses(int $user_id): array
    {
        $db = db_connect();
        $sub = $db->table('enrollments')->select('course_id')->where('user_id', $user_id);

        return $db->table('courses')
            ->select('id, title, description')
            ->whereNotIn('id', $sub)
            ->get()
            ->getResultArray();
---
SELECT `id`, `title`, `description`
FROM `courses`
WHERE `id` NOT IN (SELECT `course_id` FROM `enrollments` WHERE `user_id` = 3)