app/Models/MaterialsModel.php

    public function insertMaterial($data)
    {
        return $this->insert($data);
---
INSERT INTO `materials` (`course_id`, `file_name`, `file_path`, `created_at`) VALUES (2, 'results.pdf', 'uploads/materials/1765324888_c424858dd4ca89907a5e.pdf', '2025-12-10 00:01:28')

    public function getMaterialsByCourse($course_id)
    {
        return $this->where('course_id', $course_id)
                    ->orderBy('created_at', 'DESC')
                    ->findAll();
---
SELECT *
FROM `materials`
WHERE `course_id` = 1
ORDER BY `created_at` DESC