app/Models/NotificationModel.php

SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `user_id` = 3
AND `is_read` = 0
---
    public function getUnreadCount($userId)
    {
        return $this->where('user_id', $userId)->where('is_read', 0)->countAllResults();

SELECT *
FROM `notifications`
WHERE `user_id` = 3
AND `is_read` = 0
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function getNotificationsForUser($userId)
    {
        return $this->where('user_id', $userId)
                    ->where('is_read', 0)
                    ->orderBy('created_at', 'DESC')
                    ->limit(5)
                    ->findAll();

UPDATE `notifications` SET `is_read` = 1
WHERE `notifications`.`id` IN ('3')
---
    public function markAsRead($id)
    {
        return $this->update($id, ['is_read' => 1]);